# NaN - means Not a Number

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
n = np.nan

In [3]:
type(n)

float

In [5]:
m = 1
m + n

nan

# NaN in Series

In [6]:
s1 = Series([1,2,np.nan,3,4],index=['A','B','C','D','E'])

In [7]:
s1

A    1.0
B    2.0
C    NaN
D    3.0
E    4.0
dtype: float64

In [8]:
s1.isnull()

A    False
B    False
C     True
D    False
E    False
dtype: bool

In [9]:
s1.notnull()

A     True
B     True
C    False
D     True
E     True
dtype: bool

In [10]:
s1.dropna()

A    1.0
B    2.0
D    3.0
E    4.0
dtype: float64

# NaN in DataFrame

In [11]:
dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])

In [12]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [13]:
dframe.isnull()

       0      1      2
0  False  False  False
1   True  False  False
2  False   True  False
3   True   True   True

In [14]:
dframe.notnull()

       0      1      2
0   True   True   True
1  False   True   True
2   True  False   True
3  False  False  False

In [19]:
df1 = dframe.dropna(axis=0)

In [20]:
df1

     0    1    2
0  1.0  2.0  3.0

In [18]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [21]:
df1 = dframe.dropna(axis=1)

In [22]:
df1

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [23]:
df1 = dframe.dropna(axis=0,how='any')

In [24]:
df1

     0    1    2
0  1.0  2.0  3.0

In [26]:
df1 = dframe.dropna(axis=0,how='all')

In [27]:
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [29]:
dframe2 = DataFrame([[1,2,3,np.nan],[2,np.nan,5,6],[np.nan,7,np.nan,9],[1,np.nan,np.nan,np.nan]])

In [30]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [32]:
df2 = dframe2.dropna(thresh=None)

In [33]:
df2

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [34]:
df2 = dframe2.dropna(thresh=2)

In [35]:
df2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [36]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [37]:
dframe2.fillna(value=1)

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  5.0  6.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [38]:
dframe2.fillna(value={0:0,1:1,2:2,3:3})

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0

In [39]:
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [40]:
df2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [41]:
df1.dropna()

     0    1    2
0  1.0  2.0  3.0

In [43]:
df1.fillna(1)

     0    1    2
0  1.0  2.0  3.0
1  1.0  5.0  6.0
2  7.0  1.0  9.0

In [44]:
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0